In [37]:
import pandas as pd
stock=pd.read_csv('stock_data.txt')
stock

         Date   Close    Volume Symbol
0  2016-10-03   31.50  14070500   CSCO
1  2016-10-03  112.52  21701800   AAPL
2  2016-10-03   57.42  19189500   MSFT
3  2016-10-04  113.00  29736800   AAPL
4  2016-10-04   57.24  20085900   MSFT
5  2016-10-04   31.35  18460400   CSCO
6  2016-10-05   57.64  16726400   MSFT
7  2016-10-05   31.59  11808600   CSCO
8  2016-10-05  113.05  21453100   AAPL

In [2]:
stock.index

RangeIndex(start=0, stop=9, step=1)

In [3]:
stock.groupby(['Symbol']).Close.mean()

Symbol
AAPL    112.856667
CSCO     31.480000
MSFT     57.433333
Name: Close, dtype: float64

In [6]:
ser=stock.groupby(['Symbol','Date']).Close.mean()
ser
#please study about mean

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [7]:
ser.index #look now it is a multi index actually it is a 2 dimensional indax

MultiIndex([('AAPL', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('AAPL', '2016-10-05'),
            ('CSCO', '2016-10-03'),
            ('CSCO', '2016-10-04'),
            ('CSCO', '2016-10-05'),
            ('MSFT', '2016-10-03'),
            ('MSFT', '2016-10-04'),
            ('MSFT', '2016-10-05')],
           names=['Symbol', 'Date'])

In [11]:
ser.unstack()

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [12]:
#here we get same result
df=stock.pivot_table(values='Close',index='Symbol',columns='Date')
df

Date    2016-10-03  2016-10-04  2016-10-05
Symbol
AAPL        112.52      113.00      113.05
CSCO         31.50       31.35       31.59
MSFT         57.42       57.24       57.64

In [13]:
ser
#we want co concerntate on apple

Symbol  Date
AAPL    2016-10-03    112.52
        2016-10-04    113.00
        2016-10-05    113.05
CSCO    2016-10-03     31.50
        2016-10-04     31.35
        2016-10-05     31.59
MSFT    2016-10-03     57.42
        2016-10-04     57.24
        2016-10-05     57.64
Name: Close, dtype: float64

In [14]:
ser.loc['AAPL']#here sr and df give same result ufe ser=df

Date
2016-10-03    112.52
2016-10-04    113.00
2016-10-05    113.05
Name: Close, dtype: float64

In [15]:
ser.loc['AAPL','2016-10-03']#here sr and df give same result ufe ser=df

112.52

In [16]:
ser.loc[:,'2016-10-03']#here sr and df give same result ufe ser=df

Symbol
AAPL    112.52
CSCO     31.50
MSFT     57.42
Name: Close, dtype: float64

In [18]:
stock.set_index(['Symbol','Date'],inplace=True)
stock

                    Close    Volume
Symbol Date
CSCO   2016-10-03   31.50  14070500
AAPL   2016-10-03  112.52  21701800
MSFT   2016-10-03   57.42  19189500
AAPL   2016-10-04  113.00  29736800
MSFT   2016-10-04   57.24  20085900
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-05   57.64  16726400
CSCO   2016-10-05   31.59  11808600
AAPL   2016-10-05  113.05  21453100

In [19]:
stock.index #here we create a multi index

MultiIndex([('CSCO', '2016-10-03'),
            ('AAPL', '2016-10-03'),
            ('MSFT', '2016-10-03'),
            ('AAPL', '2016-10-04'),
            ('MSFT', '2016-10-04'),
            ('CSCO', '2016-10-04'),
            ('MSFT', '2016-10-05'),
            ('CSCO', '2016-10-05'),
            ('AAPL', '2016-10-05')],
           names=['Symbol', 'Date'])

In [20]:
stock.sort_index(inplace=True)
stock

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [21]:
stock.loc['AAPL']

             Close    Volume
Date
2016-10-03  112.52  21701800
2016-10-04  113.00  29736800
2016-10-05  113.05  21453100

In [22]:
stock.loc[('AAPL','2016-10-05'),:] #use tuple it help to debug

Close          113.05
Volume    21453100.00
Name: (AAPL, 2016-10-05), dtype: float64

In [23]:
stock.loc[('AAPL','2016-10-05'),'Volume']

21453100.0

In [25]:
stock.loc[(['AAPL','MSFT'],'2016-10-05'),'Close']

Symbol  Date
AAPL    2016-10-05    113.05
MSFT    2016-10-05     57.64
Name: Close, dtype: float64

In [28]:
stock.loc[('AAPL',['2016-10-05','2016-10-04']),'Close']

Symbol  Date
AAPL    2016-10-05    113.05
        2016-10-04    113.00
Name: Close, dtype: float64

In [31]:
stock.loc[(slice(None),['2016-10-05','2016-10-04']),:]

                    Close    Volume
Symbol Date
AAPL   2016-10-05  113.05  21453100
CSCO   2016-10-05   31.59  11808600
MSFT   2016-10-05   57.64  16726400
AAPL   2016-10-04  113.00  29736800
CSCO   2016-10-04   31.35  18460400
MSFT   2016-10-04   57.24  20085900

# merging DataFrame

In [34]:
close = pd.read_csv('stock_data.txt', usecols=[0, 1, 3], index_col=['Symbol', 'Date']).sort_index()
close

                    Close
Symbol Date
AAPL   2016-10-03  112.52
       2016-10-04  113.00
       2016-10-05  113.05
CSCO   2016-10-03   31.50
       2016-10-04   31.35
       2016-10-05   31.59
MSFT   2016-10-03   57.42
       2016-10-04   57.24
       2016-10-05   57.64

In [39]:
volume = pd.read_csv('stock_data.txt', usecols=[0, 2, 3], index_col=['Symbol', 'Date']).sort_index()
volume

                     Volume
Symbol Date
AAPL   2016-10-03  21701800
       2016-10-04  29736800
       2016-10-05  21453100
CSCO   2016-10-03  14070500
       2016-10-04  18460400
       2016-10-05  11808600
MSFT   2016-10-03  19189500
       2016-10-04  20085900
       2016-10-05  16726400

In [41]:
both=pd.merge(close,volume,left_index=True,right_index=True)
both
#you should use left index and right index otherwise it is not worke

                    Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400

In [42]:
both.reset_index

<bound method DataFrame.reset_index of                     Close    Volume
Symbol Date
AAPL   2016-10-03  112.52  21701800
       2016-10-04  113.00  29736800
       2016-10-05  113.05  21453100
CSCO   2016-10-03   31.50  14070500
       2016-10-04   31.35  18460400
       2016-10-05   31.59  11808600
MSFT   2016-10-03   57.42  19189500
       2016-10-04   57.24  20085900
       2016-10-05   57.64  16726400>